# 第一部分：直接修改字典对象的属性
p = {"text": "未修改", "sex": "未修改"}  # 定义一个字典对象 
qs = []  # 创建一个空列表 qs

# 将字典对象 p 添加到列表 qs 中10次
for q in range(0, 3):
    qs.append(p)

# 修改字典对象 p 的属性
p["text"] = "已修改"
p["sex"] = "已修改"

# 打印列表 qs 中的所有字典对象
print("直接修改字典对象的属性后：")
print(qs)  # 由于所有元素都引用同一个字典对象，所有字典对象的属性都会被修改

# 打印字典对象 p
print(f"\n字典对象 p：")
print(p)

# 第二部分：重新赋值一个新的字典对象
p = {"text": "未修改", "sex": "未修改"}  # 重新定义字典对象 p
qs = []  # 重新创建一个空列表 qs

# 将字典对象 p 添加到列表 qs 中10次
for q in range(0, 3):
    qs.append(p)

# 重新赋值一个新的字典对象给 p
p = {"text": "已修改", "sex": "已修改"}

# 打印列表 qs 中的所有字典对象
print("\n重新赋值一个新的字典对象后：")
print(qs)  # 由于重新赋值创建了一个新的字典对象，列表中的元素不会受到影响

# 打印字典对象 p
print(f"\n字典对象 p：")
print(p)
